#06: Mengganti nama (label) kolom pada Data Frame

Bryan Nicholas - 2273009

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  1  8  8  9
1  6  2  8  8  9
2  3  8  8  4  6
3  6  7  3  7  6
4  8  1  7  8  3

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [3]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  5  1     8  8  9
1  6  2     8  8  9
2  3  8     8  4  6
3  6  7     3  7  6
4  8  1     7  8  3

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [4]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       1  8     8  9
1     6       2  8     8  9
2     3       8  8     4  6
3     6       7  3     7  6
4     8       1  7     8  3